# Applications
cask 'notunes'

# Fonts
cask 'font-fira-code'

# QuickLook
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'suspicious-package'

# Shell
brew 'zsh'
brew 'eza'
brew 'fzy'
brew 'shellcheck'

# Images/Videos
brew 'ffmpeg'
brew 'imagemagick'
brew 'yt-dlp'
# brew 'mkvtoolnix'

# ruby-build
brew 'autoconf'
brew 'gmp'
brew 'libyaml'
brew 'openssl@3'
brew 'readline'

# Miscellaneous
brew 'ack'
brew 'bat'
# brew 'bfg'
brew 'duti'
brew 'git'
brew 'git-absorb'
brew 'htop'
brew 'httpie'
brew 'mise'
brew 'rename'
brew 'rg'
brew 'wget'
# brew 'wrk'
