tap 'homebrew/cask-fonts'
tap 'jonof/kenutils'

# Applications
cask 'aerial'
cask 'finicky'
# cask 'hammerspoon'
cask 'notunes'

# Fonts
brew 'svn' # Required for fonts (?!)
cask 'font-fira-code'
cask 'font-source-code-pro'

# QuickLook
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'suspicious-package'

# Go
brew 'go'

# Node
brew 'watchman'

# Swift
brew 'swiftformat'

# Shell
brew 'zsh'
brew 'shellcheck'
brew 'fzy'

# Images/Videos
brew 'ffmpeg'
brew 'graphviz'
brew 'guetzli'
brew 'imagemagick'
brew 'jonof/kenutils/pngout'
brew 'jpegoptim'
brew 'optipng'
brew 'pngcrush'
brew 'pngquant'
brew 'youtube-dl'
# brew 'mkvtoolnix'

# Miscellaneous
brew 'ack'
brew 'bat'
# brew 'bfg'
brew 'duti'
brew 'git'
brew 'htop'
brew 'httpie'
brew 'rename'
brew 'tldr'
brew 'rg'
# brew 'tmux'
brew 'wget'
# brew 'wrk'
